app/Http/Controllers/Api/StaticDataController.php

    public function companies()
    {
        try {
            $companies = Company::select('id', 'name')->get();
---
SELECT `id`, `name` FROM `companies` WHERE `companies`.`deleted_at` IS NULL

    public function sellers()
    {
        try {
            $companyId = Auth::user() ? Auth::user()->company_id : 1;
            $sellers = Seller::where('company_id', $companyId)
                ->select('id', 'name')
                ->get();
---
SELECT `id`, `name` FROM `sellers` WHERE `company_id` = 1 and `sellers`.`deleted_at` IS NULL and `sellers`.`company_id` = 1

    public function brands()
    {
        try {
            $companyId = Auth::user() ? Auth::user()->company_id : 1;
            $brands = Brand::where('company_id', $companyId)
                ->select('id', 'name')
                ->get();
---
SELECT `id`, `name` FROM `brands` WHERE `company_id` = 1 and `brands`.`deleted_at` IS NULL

    public function colors()
    {
        try {
            $companyId = Auth::user() ? Auth::user()->company_id : 1;
            $colors = Color::where('company_id', $companyId)
                ->select('id', 'name')
                ->get();
---
SELECT `id`, `name` FROM `colors` WHERE `company_id` = 1 and `colors`.`deleted_at` IS NULL ORDER BY `name` ASC

    public function reasons()
    {
        try {
            $companyId = Auth::user() ? Auth::user()->company_id : 1;
            $reasons = Reason::where('company_id', $companyId)
                ->select('id', 'name')
                ->get();
---
SELECT `id`, `name` FROM `users` WHERE `company_id` = 1 and `users`.`deleted_at` IS NULL ORDER BY `name` ASC