app/Http/Controllers/Api/StockCardController.php

SELECT * FROM `colors` WHERE `colors`.`id` in (12) and `colors`.`deleted_at` IS NULL
SELECT * FROM `sellers` WHERE `sellers`.`id` in (3) and `sellers`.`deleted_at` IS NULL and `sellers`.`company_id` = 1
SELECT * FROM `stock_cards` WHERE `stock_cards`.`id` in (193) and `stock_cards`.`deleted_at` IS NULL and `stock_cards`.`company_id` = 1
SELECT * FROM `brands` WHERE `brands`.`id` in (2) and `brands`.`deleted_at` IS NULL
---
    public function index(Request $request): JsonResponse
    {
        $query = StockCard::with(['category', 'brand', 'version', 'color', 'warehouse', 'seller'])
            ->where('company_id', Auth::user()->company_id);

        // Apply filters
        if ($request->filled('search')) {
            $query->where(function ($q) use ($request) {
                $q->where('name', 'like', '%' . $request->search . '%')
                  ->orWhere('code', 'like', '%' . $request->search . '%');
            });
        }

        if ($request->filled('category')) {
            $query->where('category_id', $request->category);
        }

        if ($request->filled('brand')) {
            $query->where('brand_id', $request->brand);
        }

        if ($request->filled('warehouse')) {
            $query->where('warehouse_id', $request->warehouse);
        }

        $stockCards = $query->orderBy('created_at', 'desc')->paginate(15);