app/Services/StockCard/StockCardServiceImplement.php

SELECT * FROM `categories` WHERE `categories`.`id` = '199' and `categories`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `brands` WHERE `brands`.`id` = 5 and `brands`.`deleted_at` IS NULL LIMIT 1
---
    public function stockSearch($request)
    {
        $data = [];
        $ssss = [];
        $stock = StockCard::with(['brand', 'category']) // Eager loading - N+1 sorununu çöz
            ->whereNull('deleted_at');

        if ($request->filled('stockName')) {
            $stock->where('name', 'like', '%' . $request->stockName . '%');
        }
        if ($request->filled('category')) {
            $categorylist = Category::where('parent_id', $request->category)->pluck('id')->toArray();
            $categorylist[] = $request->category;
            $stock->whereIn('category_id', $categorylist);
        }

        if ($request->filled('brand')) {
            $stock->where('brand_id', $request->brand);
        }

        if ($request->filled('version')) {
            $stock = $stock->whereJsonContains('version_id', $request->version);

SELECT * FROM `categories` WHERE `categories`.`id` = '199' and `categories`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `categories` WHERE `id` = 3 and `categories`.`deleted_at` IS NULL
---
    public function testParent($category_id = 0)
    {
        $data = null;

        $x = Category::find($category_id);
        if ($x) {
            $categories = Category::where('id', $x->parent_id)->get();

SELECT * FROM `stock_cards` WHERE `category_id` = '199' and `deleted_at` IS NULL
SELECT * FROM `categories` WHERE `categories`.`id` = '199' and `categories`.`deleted_at` IS NULL LIMIT 1
SELECT * FROM `brands` WHERE `brands`.`id` = 5 and `brands`.`deleted_at` IS NULL LIMIT 1
---
    public function stockData($name)
    {
        $stocks = DB::table('stock_cards')->where('category_id', $name)->whereNull('deleted_at')->get();
        foreach ($stocks as $item) {
            $data[] = array(
                'test' => $item->version_id,
                'id' => $item->id,
                'name' => $item->name,
                'sku' => $item->sku,
                'is_status' => $item->is_status,
                'barcode' => $item->barcode,
                'category_sperator_name' => $this->categorySeperator($this->testParent($item->category_id)),
                'category' => Category::find($item->category_id)->name ?? "Bulunamadı",
                'quantity' => (new \App\Models\StockCard)->quantityId($item->id),
                'brand' => Brand::find($item->brand_id)->name ?? "Bulunamadı",