app/Repositories/User/UserRepositoryImplement.php

SELECT * FROM `users` WHERE `company_id` = 1 and `users`.`deleted_at` IS NULL
---
    public function get()
    {
        return $this->model->where('company_id',Auth::user()->company_id)->get();