app/Http/Controllers/HomeController.php

    public function dashboardNewReport(Request $request)
    {
        $data = [];
        $userss = Cache::get('user_'.\auth()->user()->id);

        $users = User::where('is_status',1)->where('personel',1)->where('company_id', auth()->user()->company_id)->get();
---
SELECT * FROM `users` WHERE `is_status` = 1 and `personel` = 1 and `company_id` = 1 and `users`.`deleted_at` IS NULL