app/Http/Controllers/HomeController.php

SELECT stock_card_id, SUM(quantity) as total_quantity FROM `stock_card_movements` WHERE `stock_card_id` in (66, 265, 5428, 5429, 5430) and `company_id` = 1 and `type` = 1 and `stock_card_movements`.`deleted_at` IS NULL and `stock_card_movements`.`company_id` = 1 GROUP BY `stock_card_id`
---
    public function checkStock(Request $request)
    {
        try {
            $search = $request->input('search');

            if (empty($search)) {
                return response()->json([
                    'success' => false,
                    'message' => 'Lütfen seri numarası veya barkod giriniz'
                ]);
            }

            $user = Auth::user();
            $searchInfo = SearchHelper::determineSearchType($search);

            if (!$searchInfo) {
                return response()->json([
                    'success' => false,
                    'message' => 'Geçersiz arama formatı'
                ]);
            }

            if ($searchInfo['type'] === 'barcode') {
                // Barkod araması - StockCard tablosunda ara
                $stockCard = StockCardMovement::where('company_id', $user->company_id)
                    ->where('barcode', $searchInfo['value'])
                    ->first();

                if ($stockCard) {
                    // Barkod bulundu, stokta var mı kontrol et
                    $hasStock =  $stockCard->where('type', 1)->exists();