app/Http/Controllers/PhoneController.php

SELECT count(*) as aggregate FROM `phones` WHERE `company_id` = 1 and `phones`.`deleted_at` IS NULL
---
    public function list(Request $request)
    {
        $stockcardsList = Phone::where('company_id', Auth::user()->company_id);