app/Models/Sale.php

SELECT sum(`sale_price`) as aggregate FROM `sales` WHERE `user_id` = 14 and `company_id` = 1 and `type` = 2 and month(`created_at`) = '08' and year(`created_at`) = 2025 and `sales`.`company_id` = 1
---
    public static function totalMonthlySales($user, $type,$period)
    {
        $query = self::where('user_id', $user)
            ->where('company_id', Auth::user()->company_id)
            ->where('type', $type);

        if ($period === 'daily') {
            $query->whereDate('created_at', Carbon::today());
        } elseif ($period === 'monthly') {
            $currentMonth = Carbon::now()->month;
            $currentYear = Carbon::now()->year;
            $query->whereMonth('created_at', $currentMonth)
                ->whereYear('created_at', $currentYear);
        } else {
            throw new \InvalidArgumentException('Invalid period provided. Use "daily" or "monthly".');
        }

        return $query->sum('sale_price') ?? 0;

SELECT sum(`customer_price`) as aggregate FROM `technical_services` WHERE `payment_status` = 1 and `updated_at` between '2025-08-23 00:00:00' and '2025-08-23 23:59:59' and `company_id` = 1 and `delivery_staff` = 14
---
    public static function getTechnical($user, $request, $month)
    {
        $personData = [];
        if ($month == false) {
            $date1 = Carbon::today()->startOfDay()->format('Y-m-d H:i:s');
            $date2 = Carbon::today()->endOfDay()->format('Y-m-d H:i:s');
        } else {
            $date1 = Carbon::now()->startOfMonth()->format('Y-m-d H:i:s');
            $date2 = Carbon::now()->endOfMonth()->format('Y-m-d H:i:s');
        }

        $add_db = $request->filled('person') ? 'sellers' : 'users';
        $add_db_id = $request->filled('person') ? 'seller_id' : 'delivery_staff';

        $companyId = Auth::user()->company_id;



        $total = TechnicalService::where('payment_status', 1)
            ->whereBetween('updated_at', [$date1, $date2])
            ->where('company_id', $companyId)
            ->where($add_db_id, $user)
            ->sum('customer_price');

SELECT sum(`customer_price`) as aggregate FROM `technical_custom_services` WHERE `payment_status` = 1 and `updated_at` between '2025-08-23 00:00:00' and '2025-08-23 23:59:59' and `company_id` = 1 and `delivery_staff` = 14
---
    public static function getCover($user, $request, $month)
    {
        $personData = [];
        if ($month == false) {
            $date1 = Carbon::today()->startOfDay()->format('Y-m-d H:i:s');
            $date2 = Carbon::today()->endOfDay()->format('Y-m-d H:i:s');
        } else {
            $date1 = Carbon::now()->startOfMonth()->format('Y-m-d H:i:s');
            $date2 = Carbon::now()->endOfMonth()->format('Y-m-d H:i:s');
        }

        $add_db = $request->filled('person') ? 'sellers' : 'users';
        $add_db_id = $request->filled('person') ? 'seller_id' : 'delivery_staff';

        $companyId = Auth::user()->company_id;



        $total = TechnicalCustomService::where('payment_status', 1)
            ->whereBetween('updated_at', [$date1, $date2])
            ->where('company_id', $companyId)
            ->where($add_db_id, $user)
            ->sum('customer_price');