app/Models/StockCard.php

    public function quantityId($id)
    {
        $in = StockCardMovement::where('stock_card_id', $id)->where('company_id',Auth::user()->company_id)->where('type', 1)->sum('quantity');
---
SELECT sum(`quantity`) as aggregate FROM `stock_card_movements` WHERE `stock_card_id` = 5813 and `company_id` = 1 and `type` = 1 and `stock_card_movements`.`deleted_at` IS NULL and `stock_card_movements`.`company_id` = 1

    public static function getStockCardPrice($id)
    {
       return StockCardPrice::where('stock_card_id',$id)->where('company_id',Auth::user()->company_id)->orderBy('id','desc')->first();
---
SELECT * FROM `stock_card_prices` WHERE `stock_card_id` = 5813 and `company_id` = 1 ORDER BY `id` DESC LIMIT 1