app/Models/Transfer.php

    public function user($id)
    {
        return User::find($id);
---
SELECT * FROM `users` WHERE `users`.`id` IS NULL and `users`.`deleted_at` IS NULL LIMIT 1